Revit 2027 API
SharedParameterApplicableRule.ParameterName Property
 The name of the parameter that an element must support to pass this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ParameterName { get; set; }
Public Property ParameterName As String
	Get
	Set
public:
property String^ ParameterName {
	String^ get ();
	void set (String^ value);
}
member ParameterName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
SharedParameterApplicableRule Class
Autodesk.Revit.DB Namespace